# Core CLI tools
brew "git"
brew "git-lfs"
brew "neovim"
brew "tmux"
brew "ripgrep"
brew "fd"
brew "jq"
brew "lazygit"
brew "git-delta"
brew "tree-sitter"
brew "stow"

# Languages & runtimes
brew "node"
brew "nvm"
brew "go"
brew "lua"
brew "luajit"
brew "luarocks"
brew "python@3.13"
brew "openjdk@21"
brew "scala"
brew "sbt"

# Monitoring
brew "btop"

# Kubernetes & cloud
brew "k9s"
brew "docker"
brew "docker-completion"
brew "lazydocker"

# Build tools
brew "maven"
brew "bazelisk"
brew "buf"
brew "pre-commit"
brew "coursier"

# Other utilities
brew "coreutils"
brew "gh"
brew "grpcurl"

# Casks (GUI apps)
cask "iterm2"
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
cask "kap"

# Prompt
brew "starship"
brew "powerlevel10k"

# Window manager
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace"
